TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/driverlib/clb.h
//*****************************************************************************
//
//! Values that can be passed to CLB_configGlobalInputMux() as the
//! \e globalMuxCfg parameter.
//
//*****************************************************************************
typedef enum
{
	CLB_GLOBAL_IN_MUX_EPWM1A		 = 0,	//!EPWM1A (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM1A_OE		 = 1,	//!EPWM1A trip output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM1B		 = 2,	//!EPWM1B (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM1B_OE		 = 3,	//!EPWM1B trip output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM1_CTR_ZERO		 = 4,	//!EPWM1 TBCTR = Zero (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM1_CTR_PRD		 = 5,	//!EPWM1 TBCTR = TBPRD (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM1_CTRDIR		 = 6,	//!EPWM1 CTRDIR (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM1_TBCLK		 = 7,	//!EPWM1 TBCLK (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM1_CTR_CMPA		 = 8,	//!EPWM1 TBCTR = CMPA (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM1_CTR_CMPB		 = 9,	//!EPWM1 TBCTR = CMPB (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM1_CTR_CMPC		 = 10,	//!EPWM1 TBCTR = CMPC (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM1_CTR_CMPD		 = 11,	//!EPWM1 TBCTR = CMPD (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM1A_AQ		 = 12,	//!EPWM1A AQ submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM1B_AQ		 = 13,	//!EPWM1B AQ submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM1A_DB		 = 14,	//!EPWM1A DB submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM1B_DB		 = 15,	//!EPWM1B DB submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM2A		 = 16,	//!EPWM2A (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM2A_OE		 = 17,	//!EPWM2A trip output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM2B		 = 18,	//!EPWM2B (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM2B_OE		 = 19,	//!EPWM2B trip output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM2_CTR_ZERO		 = 20,	//!EPWM2 TBCTR = Zero (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM2_CTR_PRD		 = 21,	//!EPWM2 TBCTR = TBPRD (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM2_CTRDIR		 = 22,	//!EPWM2 CTRDIR (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM2_TBCLK		 = 23,	//!EPWM2 TBCLK (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM2_CTR_CMPA		 = 24,	//!EPWM2 TBCTR = CMPA (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM2_CTR_CMPB		 = 25,	//!EPWM2 TBCTR = CMPB (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM2_CTR_CMPC		 = 26,	//!EPWM2 TBCTR = CMPC (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM2_CTR_CMPD		 = 27,	//!EPWM2 TBCTR = CMPD (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM2A_AQ		 = 28,	//!EPWM2A AQ submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM2B_AQ		 = 29,	//!EPWM2B AQ submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM2A_DB		 = 30,	//!EPWM2A DB submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM2B_DB		 = 31,	//!EPWM2B DB submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM3A		 = 32,	//!EPWM3A (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM3A_OE		 = 33,	//!EPWM3A trip output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM3B		 = 34,	//!EPWM3B (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM3B_OE		 = 35,	//!EPWM3B trip output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM3_CTR_ZERO		 = 36,	//!EPWM3 TBCTR = Zero (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM3_CTR_PRD		 = 37,	//!EPWM3 TBCTR = TBPRD (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM3_CTRDIR		 = 38,	//!EPWM3 CTRDIR (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM3_TBCLK		 = 39,	//!EPWM3 TBCLK (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM3_CTR_CMPA		 = 40,	//!EPWM3 TBCTR = CMPA (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM3_CTR_CMPB		 = 41,	//!EPWM3 TBCTR = CMPB (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM3_CTR_CMPC		 = 42,	//!EPWM3 TBCTR = CMPC (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM3_CTR_CMPD		 = 43,	//!EPWM3 TBCTR = CMPD (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM3A_AQ		 = 44,	//!EPWM3A AQ submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM3B_AQ		 = 45,	//!EPWM3B AQ submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM3A_DB		 = 46,	//!EPWM3A DB submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM3B_DB		 = 47,	//!EPWM3B DB submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM4A		 = 48,	//!EPWM4A (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM4A_OE		 = 49,	//!EPWM4A trip output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM4B		 = 50,	//!EPWM4B (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM4B_OE		 = 51,	//!EPWM4B trip output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM4_CTR_ZERO		 = 52,	//!EPWM4 TBCTR = Zero (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM4_CTR_PRD		 = 53,	//!EPWM4 TBCTR = TBPRD (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM4_CTRDIR		 = 54,	//!EPWM4 CTRDIR (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM4_TBCLK		 = 55,	//!EPWM4 TBCLK (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM4_CTR_CMPA		 = 56,	//!EPWM4 TBCTR = CMPA (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM4_CTR_CMPB		 = 57,	//!EPWM4 TBCTR = CMPB (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM4_CTR_CMPC		 = 58,	//!EPWM4 TBCTR = CMPC (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM4_CTR_CMPD		 = 59,	//!EPWM4 TBCTR = CMPD (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM4A_AQ		 = 60,	//!EPWM4A AQ submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM4B_AQ		 = 61,	//!EPWM4B AQ submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM4A_DB		 = 62,	//!EPWM4A DB submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM4B_DB		 = 63,	//!EPWM4B DB submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB_AUXSIG0		 = 64,	//!CLB X-BAR AUXSIG0
	CLB_GLOBAL_IN_MUX_CLB_AUXSIG1		 = 65,	//!CLB X-BAR AUXSIG1
	CLB_GLOBAL_IN_MUX_CLB_AUXSIG2		 = 66,	//!CLB X-BAR AUXSIG2
	CLB_GLOBAL_IN_MUX_CLB_AUXSIG3		 = 67,	//!CLB X-BAR AUXSIG3
	CLB_GLOBAL_IN_MUX_CLB_AUXSIG4		 = 68,	//!CLB X-BAR AUXSIG4
	CLB_GLOBAL_IN_MUX_CLB_AUXSIG5		 = 69,	//!CLB X-BAR AUXSIG5
	CLB_GLOBAL_IN_MUX_CLB_AUXSIG6		 = 70,	//!CLB X-BAR AUXSIG6
	CLB_GLOBAL_IN_MUX_CLB_AUXSIG7		 = 71,	//!CLB X-BAR AUXSIG7
	CLB_GLOBAL_IN_MUX_CLB1_OUT16		 = 72,	//!CLB1 OUT16 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB1_OUT17		 = 73,	//!CLB1 OUT17 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB1_OUT18		 = 74,	//!CLB1 OUT18 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB1_OUT19		 = 75,	//!CLB1 OUT19 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB1_OUT20		 = 76,	//!CLB1 OUT20 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB1_OUT21		 = 77,	//!CLB1 OUT21 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB1_OUT22		 = 78,	//!CLB1 OUT22 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB1_OUT23		 = 79,	//!CLB1 OUT23 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB2_OUT16		 = 80,	//!CLB2 OUT16 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB2_OUT17		 = 81,	//!CLB2 OUT17 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB2_OUT18		 = 82,	//!CLB2 OUT18 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB2_OUT19		 = 83,	//!CLB2 OUT19 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB2_OUT20		 = 84,	//!CLB2 OUT20 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB2_OUT21		 = 85,	//!CLB2 OUT21 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB2_OUT22		 = 86,	//!CLB2 OUT22 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB2_OUT23		 = 87,	//!CLB2 OUT23 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM3_DCAEVT1		 = 88,	//!EPWM3 DCAEVT1
	CLB_GLOBAL_IN_MUX_EPWM3_DCAEVT2		 = 89,	//!EPWM3 DCAEVT2
	CLB_GLOBAL_IN_MUX_EPWM3_DCBEVT1		 = 90,	//!EPWM3 DCBEVT1
	CLB_GLOBAL_IN_MUX_EPWM3_DCBEVT2		 = 91,	//!EPWM3 DCBEVT2
	CLB_GLOBAL_IN_MUX_EPWM3_DCAH		 = 92,	//!EPWM3 DCAH
	CLB_GLOBAL_IN_MUX_EPWM3_DCAL		 = 93,	//!EPWM3 DCAL
	CLB_GLOBAL_IN_MUX_EPWM3_DCBH		 = 94,	//!EPWM3 DCBH
	CLB_GLOBAL_IN_MUX_EPWM3_DCBL		 = 95,	//!EPWM3 DCBL
	CLB_GLOBAL_IN_MUX_EPWM9A		 = 96,	//!EPWM9A (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM9A_OE		 = 97,	//!EPWM9A trip output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM9B		 = 98,	//!EPWM9B (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM9B_OE		 = 99,	//!EPWM9B trip output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM10A		 = 100,	//!EPWM10A (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM10A_OE		 = 101,	//!EPWM10A trip output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM10B		 = 102,	//!EPWM10B (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM10B_OE		 = 103,	//!EPWM10B trip output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CPU1_ERAD_EVENT0		 = 104,	//!CPU1 ERAD Event 0 (CLB 1-2)
	CLB_GLOBAL_IN_MUX_CPU1_ERAD_EVENT1		 = 105,	//!CPU1 ERAD Event 1 (CLB 1-2)
	CLB_GLOBAL_IN_MUX_CPU1_ERAD_EVENT2		 = 106,	//!CPU1 ERAD Event 2 (CLB 1-2)
	CLB_GLOBAL_IN_MUX_CPU1_ERAD_EVENT3		 = 107,	//!CPU1 ERAD Event 3 (CLB 1-2)
	CLB_GLOBAL_IN_MUX_CPU1_ERAD_EVENT4		 = 108,	//!CPU1 ERAD Event 4 (CLB 1-2)
	CLB_GLOBAL_IN_MUX_CPU1_ERAD_EVENT5		 = 109,	//!CPU1 ERAD Event 5 (CLB 1-2)
	CLB_GLOBAL_IN_MUX_CPU1_ERAD_EVENT6		 = 110,	//!CPU1 ERAD Event 6 (CLB 1-2)
	CLB_GLOBAL_IN_MUX_CPU1_ERAD_EVENT7		 = 111,	//!CPU1 ERAD Event 7 (CLB 1-2)
	CLB_GLOBAL_IN_MUX_FSIRXA_DATA_PACKET_RCVD		 = 112,	//!FSIRXA Data Packet Received (CLB 1-4)
	CLB_GLOBAL_IN_MUX_FSIRXA_ERROR_PACKET_RCVD		 = 113,	//!FSIRXA Error Packet Received (CLB 1-4)
	CLB_GLOBAL_IN_MUX_FSIRXA_PING_PACKET_RCVD		 = 114,	//!FSIRXA PING Packet Received (CLB 1-4)
	CLB_GLOBAL_IN_MUX_FSIRXA_OUTPUT_FRAME_DONE		 = 115,	//!FSIRXA Output Frame Done (CLB 1-4)
	CLB_GLOBAL_IN_MUX_FSIRXA_PING_TAG_MATCH2		 = 116,	//!FSIRXA PING TAG Match2 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_FSIRXA_DATA_TAG_MATCH2		 = 117,	//!FSIRXA DATA TAG Match2 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_FSIRXA_ERROR_TAG_MATCH2		 = 118,	//!FSIRXA ERROR TAG Match2 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_FSIRXA_RX_TRIG2		 = 119,	//!FSIRXA RX Trig 2 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_SPI1_SPICLK		 = 120,	//!SPI1 SPICLK OUT (CLB 1-4)
	CLB_GLOBAL_IN_MUX_SPI1_SPIPOCI_CONTROLLER		 = 121,	//!SPI1 SPIPOCI Controller IN (CLB 1-4)
	CLB_GLOBAL_IN_MUX_SPI1_SPIPTE		 = 122,	//!SPI1 SPIPTE OUT (CLB 1-4)
	CLB_GLOBAL_IN_MUX_SPI2_SPICLK		 = 123,	//!SPI2 SPICLK OUT (CLB 1-4)
	CLB_GLOBAL_IN_MUX_SPI2_SPIPOCI_CONTROLLER		 = 124,	//!SPI2 SPIPOCI Controller IN (CLB 1-4)
	CLB_GLOBAL_IN_MUX_SPI2_SPIPTE		 = 125,	//!SPI2 SPIPTE OUT (CLB 1-4)
	CLB_GLOBAL_IN_MUX_FSIRXA_RX_TRIG3		 = 127	//!FSIRXA RX Trig 3 (CLB 1-4)
} CLB_GlobalInputMux;


//*****************************************************************************
//
// Prototypes for the APIs.
//
//*****************************************************************************
//
//!
//! Checks the CLB base address.
//!
//! \param base is the base address of a CLB tile's logic config register.
//!
//! This function determines if a CLB base address is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static inline bool CLB_isBaseValid(uint32_t base)
{
    return(
           (base == CLB1_BASE) ||
           (base == CLB2_BASE)
          );
}

//*****************************************************************************
//
//!
//! Checks the CLB internal memory address.
//!
//! \param base is the base address of a CLB tile's logic config register.
//!
//! This function determines if a CLB base address is valid.
//!
//! \return Returns \b true if the address is valid and \b false otherwise.
//
//*****************************************************************************
static inline bool CLB_isAddressValid(uint32_t address)
{
    return(address <= (CLB_ADDR_HLC_BASE + CLB_NUM_HLC_INSTR));
}
#endif

//*****************************************************************************
//
//! Set global enable.
//!
//! \param base is the base address of a CLB tile's logic config register.
//!
//! This function enables the CLB via global enable register.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_enableCLB(uint32_t base)
{
    ASSERT(CLB_isBaseValid(base));

    EALLOW;
    HWREGH(base + CLB_LOGICCTL + CLB_O_LOAD_EN) |= CLB_LOAD_EN_GLOBAL_EN;
    EDIS;
}

//*****************************************************************************
//
//! Clear global enable.
//!
//! \param base is the base address of a CLB tile's logic config register.
//!
//! This function disables the CLB via global enable register.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_disableCLB(uint32_t base)
{
    ASSERT(CLB_isBaseValid(base));

    EALLOW;
    HWREGH(base + CLB_LOGICCTL + CLB_O_LOAD_EN) &= ~CLB_LOAD_EN_GLOBAL_EN;
    EDIS;
}

//*****************************************************************************
//
//! Enable HLC NMI.
//!
//! \param base is the base address of a CLB tile's logic config register.
//!
//! This function enables the CLB HLC NMI.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_enableNMI(uint32_t base)
{
    ASSERT(CLB_isBaseValid(base));

    EALLOW;
    HWREGH(base + CLB_LOGICCTL + CLB_O_LOAD_EN) |= CLB_LOAD_EN_NMI_EN;
    EDIS;
}

//*****************************************************************************
//
//! Disable HLC NMI.
//!
//! \param base is the base address of a CLB tile's logic config register.
//!
//! This function disables the CLB HLC NMI.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_disableNMI(uint32_t base)
{
    ASSERT(CLB_isBaseValid(base));

    EALLOW;
    HWREGH(base + CLB_LOGICCTL + CLB_O_LOAD_EN) &= ~CLB_LOAD_EN_NMI_EN;
    EDIS;
}

//*****************************************************************************
//
//! Configure Clock Prescalar.
//!
//! \param base is the base address of a CLB tile's logic config register.
//!
//! This function enables and configures the CLB Clock Precalar.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_configureClockPrescalar(uint32_t base, uint16_t prescl)
{
    ASSERT(CLB_isBaseValid(base));

    EALLOW;
    HWREG(base + CLB_LOGICCTL + CLB_O_PRESCALE_CTRL) =
        (HWREG(base + CLB_LOGICCTL + CLB_O_PRESCALE_CTRL) &
         ~(CLB_PRESCALE_CTRL_PRESCALE_M)) |
        ((uint32_t)prescl << CLB_PRESCALE_CTRL_PRESCALE_S);
    HWREG(base + CLB_LOGICCTL + CLB_O_PRESCALE_CTRL) |= CLB_PRESCALE_CTRL_CLKEN;
    EDIS;
}

//*****************************************************************************
//
//! Configures Clock Precalar Strobe Mode.
//!
//! \param base is the base address of a CLB tile's logic config register.
//!
//! This function enables and configures the CLB Clock Precalar Strobe Mode.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_configureStrobeMode(uint32_t base, uint16_t strb)
{
    ASSERT(CLB_isBaseValid(base));

    EALLOW;
    HWREG(base + CLB_LOGICCTL + CLB_O_PRESCALE_CTRL) =
        (HWREG(base + CLB_LOGICCTL + CLB_O_PRESCALE_CTRL) &
         ~((uint32_t)CLB_PRESCALE_CTRL_TAP_M)) |
        ((uint32_t)strb << CLB_PRESCALE_CTRL_TAP_S);
    HWREG(base + CLB_LOGICCTL + CLB_O_PRESCALE_CTRL) |= CLB_PRESCALE_CTRL_STRB;
    EDIS;
}

//*****************************************************************************
//
//! Configures the general purpose SW release control value.
//!
//! \param base is the base address of a CLB tile's logic config register.
//! \param inID is the specified CLB SW Release input signal.
//! \param val is the value of the SW RLS control.
//!
//! This function configures the general purpose SW release control value.
//! The \e inID parameter can have one enumeration value from CLB_SWReleaseCtrl.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_writeSWReleaseControl(uint32_t base,
                                            CLB_SWReleaseCtrl inID, bool val)
{
    ASSERT(CLB_isBaseValid(base));


    HWREG(base + CLB_LOGICCTL + CLB_O_GP_REG) =
            (HWREG(base + CLB_LOGICCTL + CLB_O_GP_REG) &
                ~(0x1000000U << (uint32_t)inID)) |
                    (((uint32_t)val) << (24U + (uint16_t)inID));
}


//*****************************************************************************
//
//! Configures the general purpose SW gate control value.
//!
//! \param base is the base address of a CLB tile's logic config register.
//! \param inID is the specified CLB SW Release input signal.
//! \param val is the value of the SW GATE control.
//!
//! This function configures the general purpose SW release control value.
//! The \e inID parameter can have one enumeration value from CLB_SWGateCtrl.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_writeSWGateControl(uint32_t base,
                                            CLB_SWGateCtrl inID, bool val)
{
    ASSERT(CLB_isBaseValid(base));

    HWREG(base + CLB_LOGICCTL + CLB_O_GP_REG) =
            (HWREG(base + CLB_LOGICCTL + CLB_O_GP_REG) &
                ~(0x10000U << (uint32_t)inID)) |
                    (((uint32_t)val) << (16U + (uint16_t)inID));

